In [1]:
import pandas as pd
import numpy as np

In [2]:
ele_df = pd.read_csv("dataset_group.csv")
ele_df.head()

         Date  Order_id        Product
0  01-01-2018         1         yogurt
1  01-01-2018         1           pork
2  01-01-2018         1  sandwich bags
3  01-01-2018         1     lunch meat
4  01-01-2018         1   all- purpose

In [3]:
ele_df.shape

(20641, 3)

In [5]:
ele_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20641 entries, 0 to 20640
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20641 non-null  object
 1   Order_id  20641 non-null  int64
 2   Product   20641 non-null  object
dtypes: int64(1), object(2)
memory usage: 483.9+ KB

In [6]:
ele_df.head()

         Date  Order_id        Product
0  01-01-2018         1         yogurt
1  01-01-2018         1           pork
2  01-01-2018         1  sandwich bags
3  01-01-2018         1     lunch meat
4  01-01-2018         1   all- purpose

In [7]:
ele_df.isnull().sum()

Date        0
Order_id    0
Product     0
dtype: int64

In [11]:
ele_df.describe(include = "all")

              Date      Order_id  Product
count        20641  20641.000000    20641
unique         603           NaN       37
top     08-02-2019           NaN  poultry
freq           183           NaN      640
mean           NaN    575.986289      NaN
std            NaN    328.557078      NaN
min            NaN      1.000000      NaN
25%            NaN    292.000000      NaN
50%            NaN    581.000000      NaN
75%            NaN    862.000000      NaN
max            NaN   1139.000000      NaN

In [9]:
ele_df.skew()

Order_id   -0.02807
dtype: float64

In [10]:
dups = ele_df.duplicated().sum()
print('Number of duplicate rows = %d' % (dups.sum()))

Number of duplicate rows = 4730